MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FV16KM104/mcu.h
/* IEC0 */
#define _INT0IE IEC0bits.INT0IE
#define _CCP1IE IEC0bits.CCP1IE
#define _CCP2IE IEC0bits.CCP2IE
#define _T1IE IEC0bits.T1IE
#define _CCT1IE IEC0bits.CCT1IE
#define _CCT2IE IEC0bits.CCT2IE
#define _U1RXIE IEC0bits.U1RXIE
#define _U1TXIE IEC0bits.U1TXIE
#define _AD1IE IEC0bits.AD1IE
#define _NVMIE IEC0bits.NVMIE

/* IEC1 */
#define _SSP1IE IEC1bits.SSP1IE
#define _BCL1IE IEC1bits.BCL1IE
#define _CMIE IEC1bits.CMIE
#define _CNIE IEC1bits.CNIE
#define _INT1IE IEC1bits.INT1IE
#define _INT2IE IEC1bits.INT2IE

/* IEC4 */
#define _U1ERIE IEC4bits.U1ERIE
#define _HLVDIE IEC4bits.HLVDIE
#define _CTMUIE IEC4bits.CTMUIE

/* IEC5 */
#define _ULPWUIE IEC5bits.ULPWUIE

/* IEC6 */
#define _CLC1IE IEC6bits.CLC1IE

/* IPC0 */
#define _INT0IP IPC0bits.INT0IP
#define _CCP1IP IPC0bits.CCP1IP
#define _CCP2IP IPC0bits.CCP2IP
#define _T1IP IPC0bits.T1IP
#define _INT0IP0 IPC0bits.INT0IP0
#define _INT0IP1 IPC0bits.INT0IP1
#define _INT0IP2 IPC0bits.INT0IP2
#define _CC1IP0 IPC0bits.CC1IP0
#define _CC1IP1 IPC0bits.CC1IP1
#define _CC1IP2 IPC0bits.CC1IP2
#define _CC2IP0 IPC0bits.CC2IP0
#define _CC2IP1 IPC0bits.CC2IP1
#define _CC2IP2 IPC0bits.CC2IP2
#define _T1IP0 IPC0bits.T1IP0
#define _T1IP1 IPC0bits.T1IP1
#define _T1IP2 IPC0bits.T1IP2

/* IPC1 */
#define _CCT1IP IPC1bits.CCT1IP
#define _CCT1IP0 IPC1bits.CCT1IP0
#define _CCT1IP1 IPC1bits.CCT1IP1
#define _CCT1IP2 IPC1bits.CCT1IP2

/* IPC2 */
#define _CCT2IP IPC2bits.CCT2IP
#define _U1RXIP IPC2bits.U1RXIP
#define _CCT2IP0 IPC2bits.CCT2IP0
#define _CCT2IP1 IPC2bits.CCT2IP1
#define _CCT2IP2 IPC2bits.CCT2IP2
#define _U1RXIP0 IPC2bits.U1RXIP0
#define _U1RXIP1 IPC2bits.U1RXIP1
#define _U1RXIP2 IPC2bits.U1RXIP2

/* IPC3 */
#define _U1TXIP IPC3bits.U1TXIP
#define _AD1IP IPC3bits.AD1IP
#define _NVMIP IPC3bits.NVMIP
#define _U1TXIP0 IPC3bits.U1TXIP0
#define _U1TXIP1 IPC3bits.U1TXIP1
#define _U1TXIP2 IPC3bits.U1TXIP2
#define _AD1IP0 IPC3bits.AD1IP0
#define _AD1IP1 IPC3bits.AD1IP1
#define _AD1IP2 IPC3bits.AD1IP2
#define _NVMIP0 IPC3bits.NVMIP0
#define _NVMIP1 IPC3bits.NVMIP1
#define _NVMIP2 IPC3bits.NVMIP2

/* IPC4 */
#define _SSP1IP IPC4bits.SSP1IP
#define _BCL1IP IPC4bits.BCL1IP
#define _CMIP IPC4bits.CMIP
#define _CNIP IPC4bits.CNIP
#define _SSP1IP0 IPC4bits.SSP1IP0
#define _SSP1IP1 IPC4bits.SSP1IP1
#define _SSP1IP2 IPC4bits.SSP1IP2
#define _BCL1IP0 IPC4bits.BCL1IP0
#define _BCL1IP1 IPC4bits.BCL1IP1
#define _BCL1IP2 IPC4bits.BCL1IP2
#define _CMIP0 IPC4bits.CMIP0
#define _CMIP1 IPC4bits.CMIP1
#define _CMIP2 IPC4bits.CMIP2
#define _CNIP0 IPC4bits.CNIP0
#define _CNIP1 IPC4bits.CNIP1
#define _CNIP2 IPC4bits.CNIP2

/* IPC5 */
#define _INT1IP IPC5bits.INT1IP
#define _INT1IP0 IPC5bits.INT1IP0
#define _INT1IP1 IPC5bits.INT1IP1
#define _INT1IP2 IPC5bits.INT1IP2

/* IPC7 */
#define _INT2IP IPC7bits.INT2IP
#define _INT2IP0 IPC7bits.INT2IP0
#define _INT2IP1 IPC7bits.INT2IP1
#define _INT2IP2 IPC7bits.INT2IP2

/* IPC16 */
#define _U1ERIP IPC16bits.U1ERIP
#define _U1ERIP0 IPC16bits.U1ERIP0
#define _U1ERIP1 IPC16bits.U1ERIP1
#define _U1ERIP2 IPC16bits.U1ERIP2

/* IPC18 */
#define _HLVDIP IPC18bits.HLVDIP
#define _HLVDIP0 IPC18bits.HLVDIP0
#define _HLVDIP1 IPC18bits.HLVDIP1
#define _HLVDIP2 IPC18bits.HLVDIP2

/* IPC19 */
#define _CTMUIP IPC19bits.CTMUIP
#define _CTMUIP0 IPC19bits.CTMUIP0
#define _CTMUIP1 IPC19bits.CTMUIP1
#define _CTMUIP2 IPC19bits.CTMUIP2

/* IPC20 */
#define _ULPWUIP IPC20bits.ULPWUIP
#define _ULPWUIP0 IPC20bits.ULPWUIP0
#define _ULPWUIP1 IPC20bits.ULPWUIP1
#define _ULPWUIP2 IPC20bits.ULPWUIP2

/* IPC24 */
#define _CLC1IP IPC24bits.CLC1IP
#define _CLC1IP0 IPC24bits.CLC1IP0
#define _CLC1IP1 IPC24bits.CLC1IP1
#define _CLC1IP2 IPC24bits.CLC1IP2

/* INTTREG */
#define _VECNUM INTTREGbits.VECNUM
#define _ILR INTTREGbits.ILR
#define _VHOLD INTTREGbits.VHOLD
#define _CPUIRQ INTTREGbits.CPUIRQ
#define _VECNUM0 INTTREGbits.VECNUM0
#define _VECNUM1 INTTREGbits.VECNUM1
#define _VECNUM2 INTTREGbits.VECNUM2
#define _VECNUM3 INTTREGbits.VECNUM3
#define _VECNUM4 INTTREGbits.VECNUM4
#define _VECNUM5 INTTREGbits.VECNUM5
#define _VECNUM6 INTTREGbits.VECNUM6
#define _ILR0 INTTREGbits.ILR0
#define _ILR1 INTTREGbits.ILR1
#define _ILR2 INTTREGbits.ILR2
#define _ILR3 INTTREGbits.ILR3

/* T1CON */
#define _TCS T1CONbits.TCS
#define _TSYNC T1CONbits.TSYNC
#define _TCKPS T1CONbits.TCKPS
#define _TGATE T1CONbits.TGATE
#define _TECS T1CONbits.TECS
#define _TSIDL T1CONbits.TSIDL
#define _TON T1CONbits.TON
#define _TCKPS0 T1CONbits.TCKPS0
#define _TCKPS1 T1CONbits.TCKPS1
#define _T1ECS0 T1CONbits.T1ECS0
#define _T1ECS1 T1CONbits.T1ECS1
#define _T1ECS T1CONbits.T1ECS
#define _TECS0 T1CONbits.TECS0
#define _TECS1 T1CONbits.TECS1
#define _TIECS T1CONbits.TIECS
#define _TIECS0 T1CONbits.TIECS0
#define _TIECS1 T1CONbits.TIECS1

/* CLC1CONL */
#define _MODE CLC1CONLbits.MODE
#define _LCPOL CLC1CONLbits.LCPOL
#define _LCOUT CLC1CONLbits.LCOUT
#define _LCOE CLC1CONLbits.LCOE
#define _INTN CLC1CONLbits.INTN
#define _INTP CLC1CONLbits.INTP
#define _LCEN CLC1CONLbits.LCEN
#define _MODE0 CLC1CONLbits.MODE0
#define _MODE1 CLC1CONLbits.MODE1
#define _MODE2 CLC1CONLbits.MODE2

/* CLC1CONH */
#define _G1POL CLC1CONHbits.G1POL
#define _G2POL CLC1CONHbits.G2POL
#define _G3POL CLC1CONHbits.G3POL
#define _G4POL CLC1CONHbits.G4POL

/* CLC1SEL */
#define _DS1 CLC1SELbits.DS1
#define _DS2 CLC1SELbits.DS2
#define _DS3 CLC1SELbits.DS3
#define _DS4 CLC1SELbits.DS4
#define _DS10 CLC1SELbits.DS10
#define _DS11 CLC1SELbits.DS11
#define _DS12 CLC1SELbits.DS12
#define _DS20 CLC1SELbits.DS20
#define _DS21 CLC1SELbits.DS21
#define _DS22 CLC1SELbits.DS22
#define _DS30 CLC1SELbits.DS30
#define _DS31 CLC1SELbits.DS31
#define _DS32 CLC1SELbits.DS32
#define _DS40 CLC1SELbits.DS40
#define _DS41 CLC1SELbits.DS41
#define _DS42 CLC1SELbits.DS42

/* CLC1GLSL */
#define _G1D1N CLC1GLSLbits.G1D1N
#define _G1D1T CLC1GLSLbits.G1D1T
#define _G1D2N CLC1GLSLbits.G1D2N
#define _G1D2T CLC1GLSLbits.G1D2T
#define _G1D3N CLC1GLSLbits.G1D3N
#define _G1D3T CLC1GLSLbits.G1D3T
#define _G1D4N CLC1GLSLbits.G1D4N
#define _G1D4T CLC1GLSLbits.G1D4T
#define _G2D1N CLC1GLSLbits.G2D1N
#define _G2D1T CLC1GLSLbits.G2D1T
#define _G2D2N CLC1GLSLbits.G2D2N
#define _G2D2T CLC1GLSLbits.G2D2T
#define _G2D3N CLC1GLSLbits.G2D3N
#define _G2D3T CLC1GLSLbits.G2D3T
#define _G2D4N CLC1GLSLbits.G2D4N
#define _G2D4T CLC1GLSLbits.G2D4T

/* CLC1GLSH */
#define _G3D1N CLC1GLSHbits.G3D1N
#define _G3D1T CLC1GLSHbits.G3D1T
#define _G3D2N CLC1GLSHbits.G3D2N
#define _G3D2T CLC1GLSHbits.G3D2T
#define _G3D3N CLC1GLSHbits.G3D3N
#define _G3D3T CLC1GLSHbits.G3D3T
#define _G3D4N CLC1GLSHbits.G3D4N
#define _G3D4T CLC1GLSHbits.G3D4T
#define _G4D1N CLC1GLSHbits.G4D1N
#define _G4D1T CLC1GLSHbits.G4D1T
#define _G4D2N CLC1GLSHbits.G4D2N
#define _G4D2T CLC1GLSHbits.G4D2T
#define _G4D3N CLC1GLSHbits.G4D3N
#define _G4D3T CLC1GLSHbits.G4D3T
#define _G4D4N CLC1GLSHbits.G4D4N
#define _G4D4T CLC1GLSHbits.G4D4T

/* CCP1CON1L */
/* Bitname _MOD cannot be defined because it is used by more than one SFR */
/* Bitname _CCSEL cannot be defined because it is used by more than one SFR */
/* Bitname _T32 cannot be defined because it is used by more than one SFR */
/* Bitname _TMRPS cannot be defined because it is used by more than one SFR */
/* Bitname _CLKSEL cannot be defined because it is used by more than one SFR */
/* Bitname _TMRSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _CCPSLP cannot be defined because it is used by more than one SFR */
/* Bitname _CCPSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _CCPON cannot be defined because it is used by more than one SFR */
/* Bitname _MOD0 cannot be defined because it is used by more than one SFR */
/* Bitname _MOD1 cannot be defined because it is used by more than one SFR */
/* Bitname _MOD2 cannot be defined because it is used by more than one SFR */
/* Bitname _MOD3 cannot be defined because it is used by more than one SFR */
/* Bitname _TMR32 cannot be defined because it is used by more than one SFR */
/* Bitname _TMRPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _TMRPS1 cannot be defined because it is used by more than one SFR */
/* Bitname _CLKSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _CLKSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _CLKSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPMOD cannot be defined because it is used by more than one SFR */
/* Bitname _CCPMOD0 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPMOD1 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPMOD2 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPMOD3 cannot be defined because it is used by more than one SFR */

/* CCP1CON1H */
/* Bitname _SYNC cannot be defined because it is used by more than one SFR */
/* Bitname _ALTSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _ONESHOT cannot be defined because it is used by more than one SFR */
/* Bitname _TRIGEN cannot be defined because it is used by more than one SFR */
/* Bitname _OPS cannot be defined because it is used by more than one SFR */
/* Bitname _RTRGEN cannot be defined because it is used by more than one SFR */
/* Bitname _OPSSRC cannot be defined because it is used by more than one SFR */
/* Bitname _SYNC0 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNC1 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNC2 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNC3 cannot be defined because it is used by more than one SFR */
/* Bitname _SYNC4 cannot be defined because it is used by more than one SFR */
/* Bitname _OPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _OPS1 cannot be defined because it is used by more than one SFR */
/* Bitname _OPS2 cannot be defined because it is used by more than one SFR */
/* Bitname _OPS3 cannot be defined because it is used by more than one SFR */
/* Bitname _OPSRC cannot be defined because it is used by more than one SFR */
/* Bitname _IOPS cannot be defined because it is used by more than one SFR */
/* Bitname _IOPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOPS1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOPS2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOPS3 cannot be defined because it is used by more than one SFR */

/* CCP1CON2L */
/* Bitname _ASDG cannot be defined because it is used by more than one SFR */
/* Bitname _SSDG cannot be defined because it is used by more than one SFR */
/* Bitname _ASDGM cannot be defined because it is used by more than one SFR */
/* Bitname _PWMRSEN cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG0 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG1 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG2 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG3 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG4 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG5 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG6 cannot be defined because it is used by more than one SFR */
/* Bitname _ASDG7 cannot be defined because it is used by more than one SFR */

/* CCP1CON2H */
/* Bitname _ICS cannot be defined because it is used by more than one SFR */
/* Bitname _AUXOUT cannot be defined because it is used by more than one SFR */
/* Bitname _ICGSM cannot be defined because it is used by more than one SFR */
/* Bitname _OCAEN cannot be defined because it is used by more than one SFR */
#define _OCBEN CCP1CON2Hbits.OCBEN
#define _OCCEN CCP1CON2Hbits.OCCEN
#define _OCDEN CCP1CON2Hbits.OCDEN
#define _OCEEN CCP1CON2Hbits.OCEEN
#define _OCFEN CCP1CON2Hbits.OCFEN
/* Bitname _OENSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _ICS0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICS1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICS2 cannot be defined because it is used by more than one SFR */
/* Bitname _AUXOUT0 cannot be defined because it is used by more than one SFR */
/* Bitname _AUXOUT1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICGSM0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICGSM1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICSEL cannot be defined because it is used by more than one SFR */
/* Bitname _ICSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICSEL2 cannot be defined because it is used by more than one SFR */

/* CCP1CON3L */
#define _DT CCP1CON3Lbits.DT
#define _DT0 CCP1CON3Lbits.DT0
#define _DT1 CCP1CON3Lbits.DT1
#define _DT2 CCP1CON3Lbits.DT2
#define _DT3 CCP1CON3Lbits.DT3
#define _DT4 CCP1CON3Lbits.DT4
#define _DT5 CCP1CON3Lbits.DT5

/* CCP1CON3H */
#define _PSSBDF CCP1CON3Hbits.PSSBDF
/* Bitname _PSSACE cannot be defined because it is used by more than one SFR */
#define _POLBDF CCP1CON3Hbits.POLBDF
/* Bitname _POLACE cannot be defined because it is used by more than one SFR */
#define _OUTM CCP1CON3Hbits.OUTM
/* Bitname _OSCNT cannot be defined because it is used by more than one SFR */
/* Bitname _OETRIG cannot be defined because it is used by more than one SFR */
#define _PSSBDF0 CCP1CON3Hbits.PSSBDF0
#define _PSSBDF1 CCP1CON3Hbits.PSSBDF1
/* Bitname _PSSACE0 cannot be defined because it is used by more than one SFR */
/* Bitname _PSSACE1 cannot be defined because it is used by more than one SFR */
#define _OUTM0 CCP1CON3Hbits.OUTM0
#define _OUTM1 CCP1CON3Hbits.OUTM1
#define _OUTM2 CCP1CON3Hbits.OUTM2
/* Bitname _OSCNT0 cannot be defined because it is used by more than one SFR */
/* Bitname _OSCNT1 cannot be defined because it is used by more than one SFR */
/* Bitname _OSCNT2 cannot be defined because it is used by more than one SFR */

