MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FV16KM104/mcu.h
#define _ANSELB_ANSELB6_POSITION                 0x00000006
#define _ANSELB_ANSELB6_MASK                     0x00000040
#define _ANSELB_ANSELB6_LENGTH                   0x00000001

#define _ANSELB_ANSELB7_POSITION                 0x00000007
#define _ANSELB_ANSELB7_MASK                     0x00000080
#define _ANSELB_ANSELB7_LENGTH                   0x00000001

#define _ANSELB_ANSELB8_POSITION                 0x00000008
#define _ANSELB_ANSELB8_MASK                     0x00000100
#define _ANSELB_ANSELB8_LENGTH                   0x00000001

#define _ANSELB_ANSELB9_POSITION                 0x00000009
#define _ANSELB_ANSELB9_MASK                     0x00000200
#define _ANSELB_ANSELB9_LENGTH                   0x00000001

#define _ANSELB_ANSELB12_POSITION                0x0000000C
#define _ANSELB_ANSELB12_MASK                    0x00001000
#define _ANSELB_ANSELB12_LENGTH                  0x00000001

#define _ANSELB_ANSELB13_POSITION                0x0000000D
#define _ANSELB_ANSELB13_MASK                    0x00002000
#define _ANSELB_ANSELB13_LENGTH                  0x00000001

#define _ANSELB_ANSELB14_POSITION                0x0000000E
#define _ANSELB_ANSELB14_MASK                    0x00004000
#define _ANSELB_ANSELB14_LENGTH                  0x00000001

#define _ANSELB_ANSELB15_POSITION                0x0000000F
#define _ANSELB_ANSELB15_MASK                    0x00008000
#define _ANSELB_ANSELB15_LENGTH                  0x00000001

#define _ANSC_ANSC0_POSITION                     0x00000000
#define _ANSC_ANSC0_MASK                         0x00000001
#define _ANSC_ANSC0_LENGTH                       0x00000001

#define _ANSC_ANSC1_POSITION                     0x00000001
#define _ANSC_ANSC1_MASK                         0x00000002
#define _ANSC_ANSC1_LENGTH                       0x00000001

#define _ANSC_ANSC2_POSITION                     0x00000002
#define _ANSC_ANSC2_MASK                         0x00000004
#define _ANSC_ANSC2_LENGTH                       0x00000001

#define _ANSC_ANSELC0_POSITION                   0x00000000
#define _ANSC_ANSELC0_MASK                       0x00000001
#define _ANSC_ANSELC0_LENGTH                     0x00000001

#define _ANSC_ANSELC1_POSITION                   0x00000001
#define _ANSC_ANSELC1_MASK                       0x00000002
#define _ANSC_ANSELC1_LENGTH                     0x00000001

#define _ANSC_ANSELC2_POSITION                   0x00000002
#define _ANSC_ANSELC2_MASK                       0x00000004
#define _ANSC_ANSELC2_LENGTH                     0x00000001

#define _ANSELC_ANSC0_POSITION                   0x00000000
#define _ANSELC_ANSC0_MASK                       0x00000001
#define _ANSELC_ANSC0_LENGTH                     0x00000001

#define _ANSELC_ANSC1_POSITION                   0x00000001
#define _ANSELC_ANSC1_MASK                       0x00000002
#define _ANSELC_ANSC1_LENGTH                     0x00000001

#define _ANSELC_ANSC2_POSITION                   0x00000002
#define _ANSELC_ANSC2_MASK                       0x00000004
#define _ANSELC_ANSC2_LENGTH                     0x00000001

#define _ANSELC_ANSELC0_POSITION                 0x00000000
#define _ANSELC_ANSELC0_MASK                     0x00000001
#define _ANSELC_ANSELC0_LENGTH                   0x00000001

#define _ANSELC_ANSELC1_POSITION                 0x00000001
#define _ANSELC_ANSELC1_MASK                     0x00000002
#define _ANSELC_ANSELC1_LENGTH                   0x00000001

#define _ANSELC_ANSELC2_POSITION                 0x00000002
#define _ANSELC_ANSELC2_MASK                     0x00000004
#define _ANSELC_ANSELC2_LENGTH                   0x00000001

#define _CMSTAT_C1OUT_POSITION                   0x00000000
#define _CMSTAT_C1OUT_MASK                       0x00000001
#define _CMSTAT_C1OUT_LENGTH                     0x00000001

#define _CMSTAT_C1EVT_POSITION                   0x00000008
#define _CMSTAT_C1EVT_MASK                       0x00000100
#define _CMSTAT_C1EVT_LENGTH                     0x00000001

#define _CMSTAT_CMIDL_POSITION                   0x0000000F
#define _CMSTAT_CMIDL_MASK                       0x00008000
#define _CMSTAT_CMIDL_LENGTH                     0x00000001

#define _CVRCON_CVR_POSITION                     0x00000000
#define _CVRCON_CVR_MASK                         0x0000001F
#define _CVRCON_CVR_LENGTH                       0x00000005

#define _CVRCON_CVRSS_POSITION                   0x00000005
#define _CVRCON_CVRSS_MASK                       0x00000020
#define _CVRCON_CVRSS_LENGTH                     0x00000001

#define _CVRCON_CVROE_POSITION                   0x00000006
#define _CVRCON_CVROE_MASK                       0x00000040
#define _CVRCON_CVROE_LENGTH                     0x00000001

#define _CVRCON_CVREN_POSITION                   0x00000007
#define _CVRCON_CVREN_MASK                       0x00000080
#define _CVRCON_CVREN_LENGTH                     0x00000001

#define _CVRCON_CVR0_POSITION                    0x00000000
#define _CVRCON_CVR0_MASK                        0x00000001
#define _CVRCON_CVR0_LENGTH                      0x00000001

#define _CVRCON_CVR1_POSITION                    0x00000001
#define _CVRCON_CVR1_MASK                        0x00000002
#define _CVRCON_CVR1_LENGTH                      0x00000001

#define _CVRCON_CVR2_POSITION                    0x00000002
#define _CVRCON_CVR2_MASK                        0x00000004
#define _CVRCON_CVR2_LENGTH                      0x00000001

#define _CVRCON_CVR3_POSITION                    0x00000003
#define _CVRCON_CVR3_MASK                        0x00000008
#define _CVRCON_CVR3_LENGTH                      0x00000001

#define _CVRCON_CVR4_POSITION                    0x00000004
#define _CVRCON_CVR4_MASK                        0x00000010
#define _CVRCON_CVR4_LENGTH                      0x00000001

#define _CM1CON_CCH_POSITION                     0x00000000
#define _CM1CON_CCH_MASK                         0x00000003
#define _CM1CON_CCH_LENGTH                       0x00000002

#define _CM1CON_CREF_POSITION                    0x00000004
#define _CM1CON_CREF_MASK                        0x00000030
#define _CM1CON_CREF_LENGTH                      0x00000002

#define _CM1CON_EVPOL_POSITION                   0x00000006
#define _CM1CON_EVPOL_MASK                       0x000000C0
#define _CM1CON_EVPOL_LENGTH                     0x00000002

#define _CM1CON_COUT_POSITION                    0x00000008
#define _CM1CON_COUT_MASK                        0x00000100
#define _CM1CON_COUT_LENGTH                      0x00000001

#define _CM1CON_CEVT_POSITION                    0x00000009
#define _CM1CON_CEVT_MASK                        0x00000200
#define _CM1CON_CEVT_LENGTH                      0x00000001

#define _CM1CON_CLPWR_POSITION                   0x0000000C
#define _CM1CON_CLPWR_MASK                       0x00001000
#define _CM1CON_CLPWR_LENGTH                     0x00000001

#define _CM1CON_CPOL_POSITION                    0x0000000D
#define _CM1CON_CPOL_MASK                        0x00002000
#define _CM1CON_CPOL_LENGTH                      0x00000001

#define _CM1CON_COE_POSITION                     0x0000000E
#define _CM1CON_COE_MASK                         0x00004000
#define _CM1CON_COE_LENGTH                       0x00000001

#define _CM1CON_CON_POSITION                     0x0000000F
#define _CM1CON_CON_MASK                         0x00008000
#define _CM1CON_CON_LENGTH                       0x00000001

#define _CM1CON_CCH0_POSITION                    0x00000000
#define _CM1CON_CCH0_MASK                        0x00000001
#define _CM1CON_CCH0_LENGTH                      0x00000001

#define _CM1CON_CCH1_POSITION                    0x00000001
#define _CM1CON_CCH1_MASK                        0x00000002
#define _CM1CON_CCH1_LENGTH                      0x00000001

#define _CM1CON_CREF0_POSITION                   0x00000004
#define _CM1CON_CREF0_MASK                       0x00000010
#define _CM1CON_CREF0_LENGTH                     0x00000001

#define _CM1CON_CREF1_POSITION                   0x00000005
#define _CM1CON_CREF1_MASK                       0x00000020
#define _CM1CON_CREF1_LENGTH                     0x00000001

#define _CM1CON_EVPOL0_POSITION                  0x00000006
#define _CM1CON_EVPOL0_MASK                      0x00000040
#define _CM1CON_EVPOL0_LENGTH                    0x00000001

#define _CM1CON_EVPOL1_POSITION                  0x00000007
#define _CM1CON_EVPOL1_MASK                      0x00000080
#define _CM1CON_EVPOL1_LENGTH                    0x00000001

#define _BUFCON0_BUFREF_POSITION                 0x00000000
#define _BUFCON0_BUFREF_MASK                     0x00000003
#define _BUFCON0_BUFREF_LENGTH                   0x00000002

